cosc401/project_proposal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-25 Mon 10:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GPU Accelerated Neuromorphic Training Framework</title>
<meta name="author" content="Sponsor: Jackson Mowry (Senior Design student)" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">GPU Accelerated Neuromorphic Training Framework</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9f024ca">1. Background</a></li>
<li><a href="#org6f969c2">2. Project Needs</a></li>
<li><a href="#org5a7cce9">3. Project Scope</a></li>
<li><a href="#orgb20c672">4. Potential Technical Considerations</a></li>
<li><a href="#org3921f65">5. Deliverables</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9f024ca" class="outline-2">
<h2 id="org9f024ca"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
One of the largest unsolved challenged in neuromorphic computing is the ability to efficiently train networks to perform complicated tasks. One proposed solution to this issue is evolutionary optimization, which takes inspiration for our biological world and exposes many different candidate networks to the same scenario, keeping only the best performers.
</p>

<p>
Neuromorphic computing is a novel technique that utilizes neurons and synapses to perform arbitrary computations. These networks store information both in their structure and the parameters that define the connections between neurons. Any tasks that can be solved with traditional machine learning can also be solved with neuromorphic computing, and often with much less computational power. One of the major reasons for this is that we train the structure of the network at the same time as the parameters, meaning neurons can be eliminated at any point in the training process if they are providing no benefit to the desired outcome.
</p>

<p>
Evolutionary optimization works by trying hundreds of networks simultaneously on a single task evaluating their fitness. This means that the only bottleneck is simulator speed, which is the component responsible for applying input to a network and simulating how spikes flow between different neurons. I have previously written a CPU only simulator that takes advantage of vector instructions to improve training speed by around 3x, which proves that this pathway should yield results far better than baseline performance.
</p>

<p>
Writing a more GPU based simulator would not only massively improve performance, but it would also allow us to take advantage of GPU hardware that is present on nearly every modern device. These accelerators generally sit idle when simulating neuromorphic networks, and should be taken advantage of. Additionally, lower power devices are often built with accelerators supporting OpenCL (Raspberry Pi Zero 2W), which can offer speeds orders of magnitude higher than CPU only simulation on low SWaP devices.
</p>
</div>
</div>
<div id="outline-container-org6f969c2" class="outline-2">
<h2 id="org6f969c2"><span class="section-number-2">2.</span> Project Needs</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Access to devices supporting OpenCL (or other competing GPGPU computation technology)</li>
<li>Ability to utilize the TENNLab corpus of software</li>
</ol>
</div>
</div>
<div id="outline-container-org5a7cce9" class="outline-2">
<h2 id="org5a7cce9"><span class="section-number-2">3.</span> Project Scope</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Software Development: A general purpose neuroprocessor support both fallback CPU computation and plugable GPU computation that is configurable at runtime to utilize the most performant hardware available</li>
</ol>
</div>
</div>
<div id="outline-container-orgb20c672" class="outline-2">
<h2 id="orgb20c672"><span class="section-number-2">4.</span> Potential Technical Considerations</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>GPU kernels should have the ability to be written in any applicable language, while the driver/wrapper application will likely be written in C++</li>
</ol>
</div>
</div>
<div id="outline-container-org3921f65" class="outline-2">
<h2 id="org3921f65"><span class="section-number-2">5.</span> Deliverables</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>A simple user-friendly application utilizing the TENNLab framework suite of software to enable training networks with all available hardware, likely GPUs</li>
<li>Training videos showing how to effectively utilize the application</li>
<li>Documentation for the application</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sponsor: Jackson Mowry (Senior Design student)</p>
<p class="date">Created: 2025-08-25 Mon 10:48</p>
</div>
</body>
</html>
